
# Introduction à l'analyse des données

<table>
    <tr>
        <td><img width=200 src="https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/IBM_logo.svg/800px-IBM_logo.svg.png"></td>
        <td><img width=200 src="https://skillup.online/_next/static/media/Logo.c31d02e9.svg"></td>
    </tr>
<table>

<div style="text-align: right"><a>par </a><a href="https://www.linkedin.com/in/sheriff-data/">Manuel López Sheriff</a></div>

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Cycle-d'analyse-des-données" data-toc-modified-id="Cycle-d'analyse-des-données-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Cycle d'analyse des données</a></span></li><li><span><a href="#Format-.csv" data-toc-modified-id="Format-.csv-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Format .csv</a></span></li><li><span><a href="#Exploration-des-données" data-toc-modified-id="Exploration-des-données-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Exploration des données</a></span><ul class="toc-item"><li><span><a href="#Types-de-variables" data-toc-modified-id="Types-de-variables-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Types de variables</a></span></li><li><span><a href="#Analyse-préliminaire" data-toc-modified-id="Analyse-préliminaire-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Analyse préliminaire</a></span></li><li><span><a href="#Analyse-univariée" data-toc-modified-id="Analyse-univariée-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Analyse univariée</a></span></li><li><span><a href="#Analyse-bidimensionnelle" data-toc-modified-id="Analyse-bidimensionnelle-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Analyse bidimensionnelle</a></span></li></ul></li></ul></div>

**On se connait:** c'est quoi ça?

<img width=400 src="https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Histogram_example.svg/1200px-Histogram_example.svg.png">


## Cycle d'analyse des données

1. Définir un problème
2. Collecter des données liées au problème
3. Nettoyer et prétraiter les données
4. Analyser-les
5. Faire des prévisions futures (le cas échéant)
6. Présenter vos conclusions

<img width=500 src="https://miro.medium.com/max/613/1*7jGXomv0dbEa4xjaP97hdQ.png">


## Format .csv

 - **C**omma **S**eparated **V**alues
 - Données structurées : **lignes et colonnes**
 - Format texte : peut être ouvert avec un éditeur de texte
 - Format universel : nous pouvons le charger dans Excel, Python, R, PowerBI, Tableau
 - Séparateur: `,`, `;`...

<img width=200 src="https://png.pngtree.com/png-vector/20190330/ourlarge/pngtree-csv-file-document-icon-png-image_897857.jpg">
<table>
  <tr>
    <td><img width=200 src="https://dake.es/wp-content/uploads/2022/09/logo-excel.jpg"></td>
    <td><img width=200 src="https://www.python.org/static/community_logos/python-logo-master-v3-TM-flattened.png"></td>
  </tr>
  <tr>
    <td><img width=200 src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/R_logo.svg/2560px-R_logo.svg.png"></td>
    <td><img width=200 src="https://aptude.com/wp-content/uploads/2021/11/powerbi_logo-1.png"></td>
  </tr>
</table>


## Exploration des données


Nous disposons d'un jeu de données des passagers du Titanic : `titanic.csv`</code>

<img width=500 src="https://upload.wikimedia.org/wikipedia/commons/3/31/TitanicBeken.jpg">

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("../datasets/titanic.csv")

In [3]:
titanic.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [4]:
diamonds = pd.read_csv("../datasets/diamonds.csv")

In [5]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75


### Types de variables

 - Numérique: quantitatif. Se référant à une propriété quantifiable
   - Discret: ne prend qu'un nombre fini de valeurs distinctes (ou alors $\infty$ dénombrable)
   - Continue: peut prendre un nombre infini de valeurs dans un intervalle
 - Catégoriel: qualitatif. Se référant à une propriété non quantifiable
   - Ordinale: il existe une relation d'ordre entre les catégories
   - Nominal: décrire des noms, des étiquettes, des catégories... où il n'y a pas de relation d'ordre naturel

**Exercice** : ouvrir le jeu de données dans Excel et identifier une variable de chaque type dans le jeu de données du Titanic


### Analyse préliminaire

 - Combien de lignes y a-t-il ? 
 - Combien de colonnes y a-t-il ?

In [6]:
titanic.shape

(1309, 11)

In [7]:
diamonds.shape

(53940, 10)

 - Quel type est chaque variable (colonne) ?
 - Est-ce qu'il y a des valeurs nulles ?

In [8]:
titanic.isna().sum()

Name           0
Sex            0
Age          263
Pclass         0
SibSp          0
Parch          0
Ticket         0
Fare           1
Cabin       1014
Embarked       2
Survived       0
dtype: int64


### Analyse univariée


(Posez votre question)

In [9]:
titanic.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

Combien de survivants?

In [10]:
titanic.Survived.sum()

500

Quelle est la próportion de survivants?

In [11]:
round(titanic.Survived.sum() / titanic.shape[0], 3)

0.382

La moyenne d'âge des passagers

In [12]:
round(titanic.Age.mean(), 1)

29.9

Combien d'enfants?

In [13]:
(titanic.Age < 18).sum()

154

Combien de personnes par classe?

In [14]:
titanic.Pclass.value_counts().sort_index()

1    323
2    277
3    709
Name: Pclass, dtype: int64


### Analyse bidimensionnelle


(Posez votre question)

Ya t 'il une corrélation entre le sexe et la probabilité de survie?

La semaine prochaine on continue ici